<abi-corpus version='2.2' path='build/src/libnetplan.so.0.0' architecture='elf-amd-x86_64' soname='libnetplan.so.0.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libyaml-0.so.2'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_netplan_iter_defs_per_devtype_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_iter_defs_per_devtype_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_iter_defs_per_devtype_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_get_critical' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_get_delay_vf_rebind' type='func-type' binding='global-binding' visibility='default-visibility' alias='netplan_netdef_get_delay_virtual_functions_rebind' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_get_embedded_switch_mode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='unlink_glob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_get_freq24' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_get_freq5' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write_netplan_conf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write_netplan_conf_full' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='NETPLAN_OPTIONAL_ADDRESS_TYPES' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='NETPLAN_WIFI_WOWLAN_TYPES' size='160' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_error_file' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_kvp_dynamic_pool' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_kvp_dynamic_pool_index' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_kvp_dynamic_pool_size' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_master' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__gcov_var' size='4136' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='global_backend' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='global_state' size='184' type='object-type' binding='global-binding' visibility='default-visibility' alias='netdefs' is-defined='yes'/>
    <elf-symbol name='netdefs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netdefs_ordered' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_backend_to_name' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ovs_settings_global' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_frequency_24' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_frequency_5' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../src/abi_compat.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-2'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-5'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <enum-decl name='GLogLevelFlags' naming-typedef-id='type-id-7' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='54' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='G_LOG_FLAG_RECURSION' value='1'/>
      <enumerator name='G_LOG_FLAG_FATAL' value='2'/>
      <enumerator name='G_LOG_LEVEL_ERROR' value='4'/>
      <enumerator name='G_LOG_LEVEL_CRITICAL' value='8'/>
      <enumerator name='G_LOG_LEVEL_WARNING' value='16'/>
      <enumerator name='G_LOG_LEVEL_MESSAGE' value='32'/>
      <enumerator name='G_LOG_LEVEL_INFO' value='64'/>
      <enumerator name='G_LOG_LEVEL_DEBUG' value='128'/>
      <enumerator name='G_LOG_LEVEL_MASK' value='-4'/>
    </enum-decl>
    <enum-decl name='NetplanAuthEAPMethod' naming-typedef-id='type-id-10' filepath='../src/abi.h' line='113' column='1' id='type-id-11'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_AUTH_EAP_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_EAP_TLS' value='1'/>
      <enumerator name='NETPLAN_AUTH_EAP_PEAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_EAP_TTLS' value='3'/>
      <enumerator name='NETPLAN_AUTH_EAP_METHOD_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='NetplanAuthKeyManagementType' naming-typedef-id='type-id-12' filepath='../src/abi.h' line='105' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_PSK' value='1'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_EAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_8021X' value='3'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='NetplanBackend' naming-typedef-id='type-id-14' filepath='../include/types.h' line='62' column='1' id='type-id-15'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_BACKEND_NONE' value='0'/>
      <enumerator name='NETPLAN_BACKEND_NETWORKD' value='1'/>
      <enumerator name='NETPLAN_BACKEND_NM' value='2'/>
      <enumerator name='NETPLAN_BACKEND_OVS' value='3'/>
      <enumerator name='NETPLAN_BACKEND_MAX_' value='4'/>
    </enum-decl>
    <enum-decl name='NetplanDefType' naming-typedef-id='type-id-16' filepath='../include/types.h' line='35' column='1' id='type-id-17'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_DEF_TYPE_NONE' value='0'/>
      <enumerator name='NETPLAN_DEF_TYPE_ETHERNET' value='1'/>
      <enumerator name='NETPLAN_DEF_TYPE_WIFI' value='2'/>
      <enumerator name='NETPLAN_DEF_TYPE_MODEM' value='3'/>
      <enumerator name='NETPLAN_DEF_TYPE_VIRTUAL' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BRIDGE' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BOND' value='5'/>
      <enumerator name='NETPLAN_DEF_TYPE_VLAN' value='6'/>
      <enumerator name='NETPLAN_DEF_TYPE_TUNNEL' value='7'/>
      <enumerator name='NETPLAN_DEF_TYPE_PORT' value='8'/>
      <enumerator name='NETPLAN_DEF_TYPE_VRF' value='9'/>
      <enumerator name='NETPLAN_DEF_TYPE_NM' value='10'/>
      <enumerator name='NETPLAN_DEF_TYPE_MAX_' value='11'/>
    </enum-decl>
    <enum-decl name='NetplanInfinibandMode' naming-typedef-id='type-id-18' filepath='../src/abi.h' line='54' column='1' id='type-id-19'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_IB_MODE_KERNEL' value='0'/>
      <enumerator name='NETPLAN_IB_MODE_DATAGRAM' value='1'/>
      <enumerator name='NETPLAN_IB_MODE_CONNECTED' value='2'/>
      <enumerator name='NETPLAN_IB_MODE_MAX_' value='3'/>
    </enum-decl>
    <enum-decl name='NetplanOptionalAddressFlag' naming-typedef-id='type-id-20' filepath='../src/abi.h' line='27' column='1' id='type-id-21'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV4_LL' value='1'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV6_RA' value='2'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP4' value='4'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP6' value='8'/>
      <enumerator name='NETPLAN_OPTIONAL_STATIC' value='16'/>
    </enum-decl>
    <enum-decl name='NetplanRAMode' naming-typedef-id='type-id-22' filepath='../src/abi.h' line='48' column='1' id='type-id-23'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_RA_MODE_KERNEL' value='0'/>
      <enumerator name='NETPLAN_RA_MODE_ENABLED' value='1'/>
      <enumerator name='NETPLAN_RA_MODE_DISABLED' value='2'/>
    </enum-decl>
    <enum-decl name='NetplanTristate' naming-typedef-id='type-id-24' filepath='../src/abi.h' line='160' column='1' id='type-id-25'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_TRISTATE_UNSET' value='-1'/>
      <enumerator name='NETPLAN_TRISTATE_FALSE' value='0'/>
      <enumerator name='NETPLAN_TRISTATE_TRUE' value='1'/>
    </enum-decl>
    <enum-decl name='NetplanTunnelMode' naming-typedef-id='type-id-26' filepath='../src/abi.h' line='83' column='1' id='type-id-27'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_UNKNOWN' value='0'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP' value='1'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRE' value='2'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_SIT' value='3'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_ISATAP' value='4'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI' value='5'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6IP6' value='6'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP6' value='7'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRE' value='8'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI6' value='9'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRETAP' value='10'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRETAP' value='11'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_NM_MAX' value='12'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VXLAN' value='100'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_WIREGUARD' value='101'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_MAX_' value='102'/>
    </enum-decl>
    <enum-decl name='NetplanWifiBand' naming-typedef-id='type-id-28' filepath='../src/types-internal.h' line='90' column='1' id='type-id-29'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_WIFI_BAND_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_WIFI_BAND_5' value='1'/>
      <enumerator name='NETPLAN_WIFI_BAND_24' value='2'/>
    </enum-decl>
    <enum-decl name='NetplanWifiMode' naming-typedef-id='type-id-30' filepath='../src/types-internal.h' line='74' column='1' id='type-id-31'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_WIFI_MODE_INFRASTRUCTURE' value='0'/>
      <enumerator name='NETPLAN_WIFI_MODE_ADHOC' value='1'/>
      <enumerator name='NETPLAN_WIFI_MODE_AP' value='2'/>
      <enumerator name='NETPLAN_WIFI_MODE_OTHER' value='3'/>
      <enumerator name='NETPLAN_WIFI_MODE_MAX_' value='4'/>
    </enum-decl>
    <enum-decl name='NetplanWifiWowlanFlag' naming-typedef-id='type-id-32' filepath='../src/abi.h' line='62' column='1' id='type-id-33'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DEFAULT' value='1'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_ANY' value='2'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DISCONNECT' value='4'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_MAGIC' value='8'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_GTK_REKEY_FAILURE' value='16'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_EAP_IDENTITY_REQ' value='32'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_4WAY_HANDSHAKE' value='64'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_RFKILL_RELEASE' value='128'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_TCP' value='256'/>
    </enum-decl>
    <enum-decl name='yaml_mapping_style_e' filepath='/usr/include/yaml.h' line='196' column='1' id='type-id-34'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_ANY_MAPPING_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_MAPPING_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_MAPPING_STYLE' value='2'/>
    </enum-decl>
    <enum-decl name='yaml_node_type_e' filepath='/usr/include/yaml.h' line='692' column='1' id='type-id-35'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_NO_NODE' value='0'/>
      <enumerator name='YAML_SCALAR_NODE' value='1'/>
      <enumerator name='YAML_SEQUENCE_NODE' value='2'/>
      <enumerator name='YAML_MAPPING_NODE' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_scalar_style_e' filepath='/usr/include/yaml.h' line='166' column='1' id='type-id-36'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_ANY_SCALAR_STYLE' value='0'/>
      <enumerator name='YAML_PLAIN_SCALAR_STYLE' value='1'/>
      <enumerator name='YAML_SINGLE_QUOTED_SCALAR_STYLE' value='2'/>
      <enumerator name='YAML_DOUBLE_QUOTED_SCALAR_STYLE' value='3'/>
      <enumerator name='YAML_LITERAL_SCALAR_STYLE' value='4'/>
      <enumerator name='YAML_FOLDED_SCALAR_STYLE' value='5'/>
    </enum-decl>
    <enum-decl name='yaml_sequence_style_e' filepath='/usr/include/yaml.h' line='185' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_ANY_SEQUENCE_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_SEQUENCE_STYLE' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-38'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-39'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-40'/>
    <class-decl name='NetplanAddressOptions' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-41' visibility='default' filepath='../src/types-internal.h' line='96' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lifetime' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='label' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanIPRoute' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-44' visibility='default' filepath='../src/types-internal.h' line='116' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scope' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='from' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='to' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='via' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='onlink' type-id='type-id-47' visibility='default' filepath='../src/types-internal.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='metric' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mtubytes' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='congestion_window' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='advertised_receive_window' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanIPRule' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-48' visibility='default' filepath='../src/types-internal.h' line='137' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='from' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='to' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priority' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fwmark' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tos' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWifiAccessPoint' size-in-bits='1280' is-struct='yes' naming-typedef-id='type-id-50' visibility='default' filepath='../src/types-internal.h' line='102' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-30' visibility='default' filepath='../src/types-internal.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ssid' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='band' type-id='type-id-28' visibility='default' filepath='../src/types-internal.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bssid' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hidden' type-id='type-id-47' visibility='default' filepath='../src/types-internal.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='channel' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='auth' type-id='type-id-52' visibility='default' filepath='../src/types-internal.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='has_auth' type-id='type-id-47' visibility='default' filepath='../src/types-internal.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='backend_settings' type-id='type-id-53' visibility='default' filepath='../src/types-internal.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWireguardPeer' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-54' visibility='default' filepath='../src/types-internal.h' line='82' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endpoint' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='public_key' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='preshared_key' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allowed_ips' type-id='type-id-56' visibility='default' filepath='../src/types-internal.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keepalive' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GArray' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='41' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-58' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-46' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-60' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-61' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-58' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='39' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-63' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-64' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-64' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='authentication_settings' size-in-bits='576' is-struct='yes' visibility='default' filepath='../src/abi.h' line='121' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key_management' type-id='type-id-12' visibility='default' filepath='../src/abi.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eap_method' type-id='type-id-10' visibility='default' filepath='../src/abi.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='identity' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='anonymous_identity' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='password' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ca_certificate' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='client_certificate' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='client_key' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='client_key_password' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='phase2_auth' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='131' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dhcp_overrides' size-in-bits='384' is-struct='yes' visibility='default' filepath='../src/abi.h' line='36' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_dns' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_ntp' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_hostname' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_hostname' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='use_mtu' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_routes' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_domains' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hostname' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='metric' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_backend_settings' size-in-bits='320' is-struct='yes' visibility='default' filepath='../src/abi.h' line='151' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stable_id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='passthrough' type-id='type-id-79' visibility='default' filepath='../src/abi.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_net_definition' size-in-bits='9472' is-struct='yes' visibility='default' filepath='../src/abi.h' line='185' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-16' visibility='default' filepath='../src/abi.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='backend' type-id='type-id-14' visibility='default' filepath='../src/abi.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uuid' type-id='type-id-81' visibility='default' filepath='../src/abi.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='optional' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='optional_addresses' type-id='type-id-20' visibility='default' filepath='../src/abi.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='critical' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='dhcp4' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dhcp6' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dhcp_identifier' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dhcp4_overrides' type-id='type-id-82' visibility='default' filepath='../src/abi.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dhcp6_overrides' type-id='type-id-82' visibility='default' filepath='../src/abi.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='accept_ra' type-id='type-id-22' visibility='default' filepath='../src/abi.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ip4_addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ip6_addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='address_options' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ip6_privacy' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='ip6_addr_gen_mode' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ip6_addr_gen_token' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='gateway4' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='gateway6' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ip4_nameservers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ip6_nameservers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='search_domains' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='routes' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='ip_rules' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='wireguard_peers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='linklocal' type-id='type-id-83' visibility='default' filepath='../src/abi.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='bridge' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='bond' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='peer' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='vlan_id' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='vlan_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='has_vlans' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='set_mac' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='mtubytes' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='ipv6_mtubytes' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_name' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='match' type-id='type-id-85' visibility='default' filepath='../src/abi.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='has_match' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='wake_on_lan' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='wowlan' type-id='type-id-32' visibility='default' filepath='../src/abi.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='emit_lldp' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='access_points' type-id='type-id-86' visibility='default' filepath='../src/abi.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='bond_params' type-id='type-id-87' visibility='default' filepath='../src/abi.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='modem_params' type-id='type-id-88' visibility='default' filepath='../src/abi.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='bridge_params' type-id='type-id-89' visibility='default' filepath='../src/abi.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='custom_bridging' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='tunnel' type-id='type-id-90' visibility='default' filepath='../src/abi.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='auth' type-id='type-id-52' visibility='default' filepath='../src/abi.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='has_auth' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='sriov_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='sriov_vlan_filter' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='sriov_explicit_vf_count' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='bind_driver' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='ovs_settings' type-id='type-id-91' visibility='default' filepath='../src/abi.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='backend_settings' type-id='type-id-53' visibility='default' filepath='../src/abi.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='filepath' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='tunnel_ttl' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='activation_mode' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='ignore_carrier' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='receive_checksum_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='transmit_checksum_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='tcp_segmentation_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='tcp6_segmentation_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='generic_segmentation_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='generic_receive_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8672'>
        <var-decl name='large_receive_offload' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='_private' type-id='type-id-92' visibility='default' filepath='../src/abi.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='embedded_switch_mode' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='sriov_delay_virtual_functions_rebind' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8864'>
        <var-decl name='ib_mode' type-id='type-id-18' visibility='default' filepath='../src/abi.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='regulatory_domain' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='vrf_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='vrf_table' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9056'>
        <var-decl name='bridge_neigh_suppress' type-id='type-id-24' visibility='default' filepath='../src/abi.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='has_vxlans' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='vxlan' type-id='type-id-93' visibility='default' filepath='../src/abi.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='bridge_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='bond_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='peer_link' type-id='type-id-84' visibility='default' filepath='../src/abi.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='has_backend_settings_nm' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='386' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_parser' size-in-bits='3264' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='188' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doc' type-id='type-id-95' visibility='default' filepath='../src/types-internal.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parsed_defs' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ordered' type-id='type-id-64' visibility='default' filepath='../src/types-internal.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='global_backend' type-id='type-id-14' visibility='default' filepath='../src/types-internal.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='global_ovs_settings' type-id='type-id-91' visibility='default' filepath='../src/types-internal.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='sources' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='current' type-id='type-id-96' visibility='default' filepath='../src/types-internal.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='missing_id' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='ids_in_file' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='missing_ids_found' type-id='type-id-38' visibility='default' filepath='../src/types-internal.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='null_fields' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='null_overrides' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='global_renderer' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='245' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_state' size-in-bits='1472' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='171' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdefs' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='netdefs_ordered' type-id='type-id-64' visibility='default' filepath='../src/types-internal.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backend' type-id='type-id-14' visibility='default' filepath='../src/types-internal.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ovs_settings' type-id='type-id-91' visibility='default' filepath='../src/types-internal.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='sources' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='global_renderer' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_vxlan' size-in-bits='576' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='152' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='type-id-84' visibility='default' filepath='../src/types-internal.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vni' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ageing' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='limit' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tos' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flow_label' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='source_port_min' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='source_port_max' type-id='type-id-46' visibility='default' filepath='../src/types-internal.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mac_learning' type-id='type-id-24' visibility='default' filepath='../src/types-internal.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='arp_proxy' type-id='type-id-24' visibility='default' filepath='../src/types-internal.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='short_circuit' type-id='type-id-24' visibility='default' filepath='../src/types-internal.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='independent' type-id='type-id-47' visibility='default' filepath='../src/types-internal.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='notifications' type-id='type-id-99' visibility='default' filepath='../src/types-internal.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='checksums' type-id='type-id-99' visibility='default' filepath='../src/types-internal.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='extensions' type-id='type-id-99' visibility='default' filepath='../src/types-internal.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='do_not_fragment' type-id='type-id-24' visibility='default' filepath='../src/types-internal.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ovs_controller' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='134' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection_mode' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='136' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ovs_settings' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../src/abi.h' line='139' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='external_ids' type-id='type-id-86' visibility='default' filepath='../src/abi.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='other_config' type-id='type-id-86' visibility='default' filepath='../src/abi.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lacp' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fail_mode' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mcast_snooping' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocols' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rstp' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='controller' type-id='type-id-102' visibility='default' filepath='../src/abi.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ssl' type-id='type-id-52' visibility='default' filepath='../src/abi.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='private_netdef_data' size-in-bits='64' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='70' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dirty_fields' type-id='type-id-86' visibility='default' filepath='../src/types-internal.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_document_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='780' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nodes' type-id='type-id-105' visibility='default' filepath='/usr/include/yaml.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='version_directive' type-id='type-id-106' visibility='default' filepath='/usr/include/yaml.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tag_directives' type-id='type-id-107' visibility='default' filepath='/usr/include/yaml.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='end_implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_mark_s' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='147' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='column' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_node_pair_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='711' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_node_s' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='719' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-112' visibility='default' filepath='/usr/include/yaml.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-114' visibility='default' filepath='/usr/include/yaml.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='end_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='775' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_tag_directive_s' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='91' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_version_directive_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='83' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/types-internal.h' line='203' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdef' type-id='type-id-84' visibility='default' filepath='../src/types-internal.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auth' type-id='type-id-117' visibility='default' filepath='../src/types-internal.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='access_point' type-id='type-id-118' visibility='default' filepath='../src/types-internal.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wireguard_peer' type-id='type-id-119' visibility='default' filepath='../src/types-internal.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='addr_options' type-id='type-id-120' visibility='default' filepath='../src/types-internal.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='route' type-id='type-id-121' visibility='default' filepath='../src/types-internal.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ip_rule' type-id='type-id-122' visibility='default' filepath='../src/types-internal.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vxlan' type-id='type-id-93' visibility='default' filepath='../src/types-internal.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filepath' type-id='type-id-123' visibility='default' filepath='../src/types-internal.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='backend' type-id='type-id-14' visibility='default' filepath='../src/types-internal.h' line='220' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='310' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='local_ip' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='remote_ip' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='input_key' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output_key' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='private_key' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fwmark' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='port' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='298' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ageing_time' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='port_priority' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='forward_delay' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hello_time' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_age' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='path_cost' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='stp' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='285' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='apn' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auto_config' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device_id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='network_id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='number' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='password' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pin' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sim_id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sim_operator_id' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='username' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='295' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='246' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='original_name' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='1216' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='260' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lacp_rate' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='monitor_interval' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_links' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transmit_hash_policy' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='selection_logic' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='all_members_active' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='arp_interval' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='arp_ip_targets' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='arp_validate' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arp_all_targets' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='up_delay' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='down_delay' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='fail_over_mac_policy' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='gratuitous_arp' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='packets_per_member' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='primary_reselect_policy' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='resend_igmp' type-id='type-id-46' visibility='default' filepath='../src/abi.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='learn_interval' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='primary_member' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='281' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='218' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipv4' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv6' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='220' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='741' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-125' visibility='default' filepath='/usr/include/yaml.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-126' visibility='default' filepath='/usr/include/yaml.h' line='752' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='756' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pairs' type-id='type-id-128' visibility='default' filepath='/usr/include/yaml.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='767' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='731' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='style' type-id='type-id-131' visibility='default' filepath='/usr/include/yaml.h' line='737' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='743' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-132' visibility='default' filepath='/usr/include/yaml.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-132' visibility='default' filepath='/usr/include/yaml.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-132' visibility='default' filepath='/usr/include/yaml.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='758' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-133' visibility='default' filepath='/usr/include/yaml.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-133' visibility='default' filepath='/usr/include/yaml.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-133' visibility='default' filepath='/usr/include/yaml.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='783' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='796' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-135' visibility='default' filepath='/usr/include/yaml.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-135' visibility='default' filepath='/usr/include/yaml.h' line='800' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-65' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-136'/>
    <typedef-decl name='GArray' type-id='type-id-57' filepath='/usr/include/glib-2.0/glib/garray.h' line='37' column='1' id='type-id-137'/>
    <typedef-decl name='GData' type-id='type-id-138' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='36' column='1' id='type-id-139'/>
    <typedef-decl name='GError' type-id='type-id-59' filepath='/usr/include/glib-2.0/glib/gerror.h' line='41' column='1' id='type-id-140'/>
    <typedef-decl name='GHashTable' type-id='type-id-141' filepath='/usr/include/glib-2.0/glib/ghash.h' line='37' column='1' id='type-id-142'/>
    <typedef-decl name='GList' type-id='type-id-62' filepath='/usr/include/glib-2.0/glib/glist.h' line='37' column='1' id='type-id-143'/>
    <typedef-decl name='GLogLevelFlags' type-id='type-id-8' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='68' column='1' id='type-id-7'/>
    <typedef-decl name='GQuark' type-id='type-id-144' filepath='/usr/include/glib-2.0/glib/gquark.h' line='36' column='1' id='type-id-60'/>
    <typedef-decl name='NetplanAddressOptions' type-id='type-id-42' filepath='../src/types-internal.h' line='100' column='1' id='type-id-41'/>
    <typedef-decl name='NetplanAuthEAPMethod' type-id='type-id-11' filepath='../src/abi.h' line='119' column='1' id='type-id-10'/>
    <typedef-decl name='NetplanAuthKeyManagementType' type-id='type-id-13' filepath='../src/abi.h' line='111' column='1' id='type-id-12'/>
    <typedef-decl name='NetplanAuthenticationSettings' type-id='type-id-76' filepath='../src/abi.h' line='132' column='1' id='type-id-52'/>
    <typedef-decl name='NetplanBackend' type-id='type-id-15' filepath='../include/types.h' line='68' column='1' id='type-id-14'/>
    <typedef-decl name='NetplanBackendSettings' type-id='type-id-78' filepath='../src/abi.h' line='157' column='1' id='type-id-53'/>
    <typedef-decl name='NetplanDHCPOverrides' type-id='type-id-77' filepath='../src/abi.h' line='46' column='1' id='type-id-82'/>
    <typedef-decl name='NetplanDefType' type-id='type-id-17' filepath='../include/types.h' line='52' column='1' id='type-id-16'/>
    <typedef-decl name='NetplanError' type-id='type-id-140' filepath='../include/types.h' line='70' column='1' id='type-id-145'/>
    <typedef-decl name='NetplanFlags' type-id='type-id-38' filepath='../src/abi.h' line='23' column='1' id='type-id-99'/>
    <typedef-decl name='NetplanIPRoute' type-id='type-id-45' filepath='../src/types-internal.h' line='135' column='1' id='type-id-44'/>
    <typedef-decl name='NetplanIPRule' type-id='type-id-49' filepath='../src/types-internal.h' line='150' column='1' id='type-id-48'/>
    <typedef-decl name='NetplanInfinibandMode' type-id='type-id-19' filepath='../src/abi.h' line='60' column='1' id='type-id-18'/>
    <typedef-decl name='NetplanNetDefinition' type-id='type-id-80' filepath='../include/types.h' line='59' column='1' id='type-id-146'/>
    <typedef-decl name='NetplanOVSController' type-id='type-id-100' filepath='../src/abi.h' line='137' column='1' id='type-id-102'/>
    <typedef-decl name='NetplanOVSSettings' type-id='type-id-101' filepath='../src/abi.h' line='149' column='1' id='type-id-91'/>
    <typedef-decl name='NetplanOptionalAddressFlag' type-id='type-id-21' filepath='../src/abi.h' line='33' column='1' id='type-id-20'/>
    <typedef-decl name='NetplanParser' type-id='type-id-94' filepath='../include/types.h' line='54' column='1' id='type-id-147'/>
    <typedef-decl name='NetplanRAMode' type-id='type-id-23' filepath='../src/abi.h' line='52' column='1' id='type-id-22'/>
    <typedef-decl name='NetplanState' type-id='type-id-97' filepath='../include/types.h' line='60' column='1' id='type-id-148'/>
    <typedef-decl name='NetplanTristate' type-id='type-id-25' filepath='../src/abi.h' line='178' column='1' id='type-id-24'/>
    <typedef-decl name='NetplanTunnelMode' type-id='type-id-27' filepath='../src/abi.h' line='103' column='1' id='type-id-26'/>
    <typedef-decl name='NetplanVxlan' type-id='type-id-98' filepath='../src/abi.h' line='180' column='1' id='type-id-149'/>
    <typedef-decl name='NetplanWifiAccessPoint' type-id='type-id-51' filepath='../src/types-internal.h' line='114' column='1' id='type-id-50'/>
    <typedef-decl name='NetplanWifiBand' type-id='type-id-29' filepath='../src/types-internal.h' line='94' column='1' id='type-id-28'/>
    <typedef-decl name='NetplanWifiMode' type-id='type-id-31' filepath='../src/types-internal.h' line='80' column='1' id='type-id-30'/>
    <typedef-decl name='NetplanWifiWowlanFlag' type-id='type-id-33' filepath='../src/abi.h' line='72' column='1' id='type-id-32'/>
    <typedef-decl name='NetplanWireguardPeer' type-id='type-id-55' filepath='../src/types-internal.h' line='88' column='1' id='type-id-54'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-150' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-151'/>
    <typedef-decl name='__off64_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-71'/>
    <typedef-decl name='__off_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-68'/>
    <typedef-decl name='__ssize_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-152'/>
    <typedef-decl name='gboolean' type-id='type-id-61' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='50' column='1' id='type-id-47'/>
    <typedef-decl name='gchar' type-id='type-id-1' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='46' column='1' id='type-id-153'/>
    <typedef-decl name='gint' type-id='type-id-38' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='49' column='1' id='type-id-61'/>
    <typedef-decl name='gsize' type-id='type-id-3' filepath='/usr/lib/glib-2.0/include/glibconfig.h' line='78' column='1' id='type-id-154'/>
    <typedef-decl name='guint' type-id='type-id-155' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='55' column='1' id='type-id-46'/>
    <typedef-decl name='guint32' type-id='type-id-155' filepath='/usr/lib/glib-2.0/include/glibconfig.h' line='52' column='1' id='type-id-144'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/11.2.0/include/stddef.h' line='209' column='1' id='type-id-75'/>
    <typedef-decl name='ssize_t' type-id='type-id-152' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-156'/>
    <typedef-decl name='uuid_t' type-id='type-id-157' filepath='/usr/include/uuid/uuid.h' line='44' column='1' id='type-id-81'/>
    <typedef-decl name='yaml_char_t' type-id='type-id-158' filepath='/usr/include/yaml.h' line='80' column='1' id='type-id-159'/>
    <typedef-decl name='yaml_document_t' type-id='type-id-104' filepath='/usr/include/yaml.h' line='813' column='1' id='type-id-95'/>
    <typedef-decl name='yaml_mapping_style_t' type-id='type-id-34' filepath='/usr/include/yaml.h' line='205' column='1' id='type-id-129'/>
    <typedef-decl name='yaml_mark_t' type-id='type-id-109' filepath='/usr/include/yaml.h' line='156' column='1' id='type-id-108'/>
    <typedef-decl name='yaml_node_item_t' type-id='type-id-38' filepath='/usr/include/yaml.h' line='708' column='1' id='type-id-160'/>
    <typedef-decl name='yaml_node_pair_t' type-id='type-id-110' filepath='/usr/include/yaml.h' line='716' column='1' id='type-id-161'/>
    <typedef-decl name='yaml_node_t' type-id='type-id-111' filepath='/usr/include/yaml.h' line='705' column='1' id='type-id-162'/>
    <typedef-decl name='yaml_node_type_t' type-id='type-id-35' filepath='/usr/include/yaml.h' line='702' column='1' id='type-id-112'/>
    <typedef-decl name='yaml_scalar_style_t' type-id='type-id-36' filepath='/usr/include/yaml.h' line='182' column='1' id='type-id-131'/>
    <typedef-decl name='yaml_sequence_style_t' type-id='type-id-37' filepath='/usr/include/yaml.h' line='193' column='1' id='type-id-126'/>
    <typedef-decl name='yaml_tag_directive_t' type-id='type-id-115' filepath='/usr/include/yaml.h' line='96' column='1' id='type-id-163'/>
    <typedef-decl name='yaml_version_directive_t' type-id='type-id-116' filepath='/usr/include/yaml.h' line='88' column='1' id='type-id-164'/>
    <union-decl name='__anonymous_union__' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='728' column='1' id='type-id-114'>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-130' visibility='default' filepath='/usr/include/yaml.h' line='738' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence' type-id='type-id-124' visibility='default' filepath='/usr/include/yaml.h' line='753' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping' type-id='type-id-127' visibility='default' filepath='/usr/include/yaml.h' line='768' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-9'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-158'/>
    <array-type-def dimensions='1' type-id='type-id-158' size-in-bits='128' id='type-id-157'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-3' id='type-id-165'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-155'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-69'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-146' const='yes' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-183'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-70'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-138'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-175'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-176'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-177'/>
    <class-decl name='netdef_pertype_iter' size-in-bits='448' is-struct='yes' visibility='default' filepath='../src/util.c' line='712' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-16' visibility='default' filepath='../src/util.c' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iter' type-id='type-id-187' visibility='default' filepath='../src/util.c' line='714' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='np_state' type-id='type-id-173' visibility='default' filepath='../src/util.c' line='715' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='variadic parameter type' id='type-id-188'/>
    <type-decl name='void' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-189'/>
    <function-decl name='netplan_state_new' filepath='../include/netplan.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='netplan_state_reset' filepath='../include/netplan.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_state_clear' filepath='../include/netplan.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_state_get_backend' filepath='../include/netplan.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='netplan_state_get_netdefs_size' filepath='../include/netplan.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='netplan_state_get_netdef' filepath='../include/netplan.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='netplan_state_dump_yaml' filepath='../include/netplan.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_yaml' filepath='../include/netplan.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_load_keyfile' filepath='../include/parse-nm.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_new' filepath='../include/parse.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='netplan_parser_reset' filepath='../include/parse.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_parser_clear' filepath='../include/parse.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml' filepath='../include/parse.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_import_parser_results' filepath='../include/parse.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_get_id_from_nm_filepath' filepath='../include/util.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <var-decl name='global_state' type-id='type-id-148' mangled-name='global_state' visibility='default' filepath='../src/abi_compat.c' line='64' column='1' elf-symbol-id='global_state'/>
    <function-decl name='netplan_get_global_backend' mangled-name='netplan_get_global_backend' filepath='../src/abi_compat.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_global_backend'>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='netplan_clear_netdefs' mangled-name='netplan_clear_netdefs' filepath='../src/abi_compat.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_clear_netdefs'>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='netplan_parse_yaml' mangled-name='netplan_parse_yaml' filepath='../src/abi_compat.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parse_yaml'>
      <parameter type-id='type-id-123' name='filename' filepath='../src/abi_compat.c' line='89' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/abi_compat.c' line='89' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_finish_parse' mangled-name='netplan_finish_parse' filepath='../src/abi_compat.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_finish_parse'>
      <parameter type-id='type-id-168' name='error' filepath='../src/abi_compat.c' line='98' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='write_netplan_conf' mangled-name='write_netplan_conf' filepath='../src/abi_compat.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write_netplan_conf'>
      <parameter type-id='type-id-179' name='def' filepath='../src/abi_compat.c' line='112' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/abi_compat.c' line='112' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='write_netplan_conf_full' mangled-name='write_netplan_conf_full' filepath='../src/abi_compat.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write_netplan_conf_full'>
      <parameter type-id='type-id-123' name='file_hint' filepath='../src/abi_compat.c' line='124' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/abi_compat.c' line='124' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_parse_keyfile' mangled-name='netplan_parse_keyfile' filepath='../src/abi_compat.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parse_keyfile'>
      <parameter type-id='type-id-123' name='filename' filepath='../src/abi_compat.c' line='138' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/abi_compat.c' line='138' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='process_input_file' mangled-name='process_input_file' filepath='../src/abi_compat.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='process_input_file'>
      <parameter type-id='type-id-123' name='f' filepath='../src/abi_compat.c' line='144' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='process_yaml_hierarchy' mangled-name='process_yaml_hierarchy' filepath='../src/abi_compat.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='process_yaml_hierarchy'>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/abi_compat.c' line='156' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_write_netplan_conf' mangled-name='_write_netplan_conf' filepath='../src/abi_compat.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_write_netplan_conf'>
      <parameter type-id='type-id-123' name='netdef_id' filepath='../src/abi_compat.c' line='171' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/abi_compat.c' line='171' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_get_filename_by_id' mangled-name='netplan_get_filename_by_id' filepath='../src/abi_compat.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_filename_by_id'>
      <parameter type-id='type-id-123' name='netdef_id' filepath='../src/abi_compat.c' line='190' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/abi_compat.c' line='190' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='_netplan_state_new_netdef_pertype_iter' filepath='../src/abi_compat.c' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='_netplan_iter_defs_per_devtype_init' mangled-name='_netplan_iter_defs_per_devtype_init' filepath='../src/abi_compat.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_iter_defs_per_devtype_init'>
      <parameter type-id='type-id-123' name='devtype' filepath='../src/abi_compat.c' line='215' column='1'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='_netplan_netdef_id' mangled-name='_netplan_netdef_id' filepath='../src/abi_compat.c' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_id'>
      <parameter type-id='type-id-84' name='netdef' filepath='../src/abi_compat.c' line='221' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_filename' mangled-name='netplan_netdef_get_filename' filepath='../src/abi_compat.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_filename'>
      <parameter type-id='type-id-179' name='netdef' filepath='../src/abi_compat.c' line='227' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_embedded_switch_mode' mangled-name='netplan_netdef_get_embedded_switch_mode' filepath='../src/abi_compat.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_embedded_switch_mode'>
      <parameter type-id='type-id-179' name='netdef' filepath='../src/abi_compat.c' line='237' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_get_id_from_nm_filename' mangled-name='netplan_get_id_from_nm_filename' filepath='../src/abi_compat.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_id_from_nm_filename'>
      <parameter type-id='type-id-123' name='filename' filepath='../src/abi_compat.c' line='250' column='1'/>
      <parameter type-id='type-id-123' name='ssid' filepath='../src/abi_compat.c' line='250' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='netplan_state_has_nondefault_globals' filepath='../src/types-internal.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml_hierarchy' filepath='../src/util-internal.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_build_path' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup' filepath='/usr/include/glib-2.0/glib/ghash.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='g_free' filepath='/usr/include/glib-2.0/glib/gmem.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_log' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_fprintf' filepath='/usr/include/glib-2.0/glib/gprintf.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='g_strdup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_strndup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_assertion_message_expr' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-74' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-63'/>
    <typedef-decl name='gconstpointer' type-id='type-id-189' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='104' column='1' id='type-id-190'/>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/error.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <class-decl name='_GBufferedInputStream' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='47' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-192' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-193' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GCancellable' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='47' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-196' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDataInputStream' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='48' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-198' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-199' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFileInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='50' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-201' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-202' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFilterInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='46' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-201' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_stream' type-id='type-id-204' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GInputStream' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='47' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-206' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='265' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-208' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-46' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-79' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GString' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='41' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-58' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-154' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-154' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeClass' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='424' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-211' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='427' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='434' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-213' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='437' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-215' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBufferedInputStream' type-id='type-id-191' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='36' column='1' id='type-id-198'/>
    <typedef-decl name='GBufferedInputStreamPrivate' type-id='type-id-216' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='45' column='1' id='type-id-217'/>
    <typedef-decl name='GCancellable' type-id='type-id-194' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='38' column='1' id='type-id-218'/>
    <typedef-decl name='GCancellablePrivate' type-id='type-id-219' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='45' column='1' id='type-id-220'/>
    <typedef-decl name='GDataInputStream' type-id='type-id-197' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='44' column='1' id='type-id-221'/>
    <typedef-decl name='GDataInputStreamPrivate' type-id='type-id-222' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='46' column='1' id='type-id-223'/>
    <typedef-decl name='GFile' type-id='type-id-224' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='84' column='1' id='type-id-225'/>
    <typedef-decl name='GFileInputStream' type-id='type-id-200' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='96' column='1' id='type-id-226'/>
    <typedef-decl name='GFileInputStreamPrivate' type-id='type-id-227' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='48' column='1' id='type-id-228'/>
    <typedef-decl name='GFilterInputStream' type-id='type-id-203' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='74' column='1' id='type-id-192'/>
    <typedef-decl name='GInputStream' type-id='type-id-205' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='108' column='1' id='type-id-201'/>
    <typedef-decl name='GInputStreamPrivate' type-id='type-id-229' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='45' column='1' id='type-id-230'/>
    <typedef-decl name='GObject' type-id='type-id-207' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='190' column='1' id='type-id-195'/>
    <typedef-decl name='GString' type-id='type-id-209' filepath='/usr/include/glib-2.0/glib/gstring.h' line='39' column='1' id='type-id-231'/>
    <typedef-decl name='GType' type-id='type-id-154' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='400' column='1' id='type-id-211'/>
    <typedef-decl name='GTypeClass' type-id='type-id-210' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='407' column='1' id='type-id-232'/>
    <typedef-decl name='GTypeInstance' type-id='type-id-212' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='409' column='1' id='type-id-208'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-233'/>
    <typedef-decl name='uint64_t' type-id='type-id-233' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-234'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-243'/>
    <class-decl name='_GBufferedInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-216'/>
    <class-decl name='_GCancellablePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-219'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-244'/>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-222'/>
    <class-decl name='_GFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-224'/>
    <class-decl name='_GFileInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-227'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-229'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-215'/>
    <function-decl name='netplan_error_clear' mangled-name='netplan_error_clear' filepath='../src/error.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_clear'>
      <parameter type-id='type-id-170' name='error' filepath='../src/error.c' line='185' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='netplan_error_message' mangled-name='netplan_error_message' filepath='../src/error.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_message'>
      <parameter type-id='type-id-169' name='error' filepath='../src/error.c' line='191' column='1'/>
      <parameter type-id='type-id-43' name='buf' filepath='../src/error.c' line='191' column='1'/>
      <parameter type-id='type-id-75' name='buf_size' filepath='../src/error.c' line='191' column='1'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='netplan_error_code' mangled-name='netplan_error_code' filepath='../src/error.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_code'>
      <parameter type-id='type-id-169' name='error' filepath='../src/error.c' line='197' column='1'/>
      <return type-id='type-id-234'/>
    </function-decl>
    <function-decl name='netplan_copy_string' filepath='../src/util-internal.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='g_data_input_stream_new' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <function-decl name='g_data_input_stream_read_line' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='g_file_new_for_path' filepath='/usr/include/glib-2.0/gio/gfile.h' line='598' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='g_file_read' filepath='/usr/include/glib-2.0/gio/gfile.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-238'/>
    </function-decl>
    <function-decl name='g_input_stream_get_type' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='g_set_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_clear_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_vasprintf' filepath='/usr/include/glib-2.0/glib/gprintf.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='g_string_sized_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='/usr/include/glib-2.0/glib/gstring.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-215' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-245'/>
    <function-decl name='g_object_unref' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_type_check_instance_cast' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2387' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-240'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/names.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-246' size-in-bits='256' id='type-id-247'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-3' id='type-id-248'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-246'/>
    <var-decl name='netplan_backend_to_str' type-id='type-id-247' mangled-name='netplan_backend_to_name' visibility='default' filepath='../src/names.c' line='25' column='1' elf-symbol-id='netplan_backend_to_name'/>
    <function-decl name='netplan_backend_name' mangled-name='netplan_backend_name' filepath='../src/names.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_backend_name'>
      <parameter type-id='type-id-14' name='val' filepath='../src/names.c' line='117' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_def_type_name' mangled-name='netplan_def_type_name' filepath='../src/names.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_def_type_name'>
      <parameter type-id='type-id-16' name='val' filepath='../src/names.c' line='118' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_tunnel_mode_name' mangled-name='tunnel_mode_to_string' filepath='../src/names.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tunnel_mode_to_string'>
      <parameter type-id='type-id-26' name='val' filepath='../src/names.c' line='121' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='g_strcmp0' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/netplan.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <enum-decl name='NetplanAddrGenMode' naming-typedef-id='type-id-249' filepath='../src/types-internal.h' line='30' column='1' id='type-id-250'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NETPLAN_ADDRGEN_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_ADDRGEN_EUI64' value='1'/>
      <enumerator name='NETPLAN_ADDRGEN_STABLEPRIVACY' value='2'/>
      <enumerator name='NETPLAN_ADDRGEN_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_break_e' filepath='/usr/include/yaml.h' line='112' column='1' id='type-id-251'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_ANY_BREAK' value='0'/>
      <enumerator name='YAML_CR_BREAK' value='1'/>
      <enumerator name='YAML_LN_BREAK' value='2'/>
      <enumerator name='YAML_CRLN_BREAK' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_emitter_state_e' filepath='/usr/include/yaml.h' line='1485' column='1' id='type-id-252'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_EMIT_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_EMIT_FIRST_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_EMIT_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_EMIT_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_EMIT_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_FIRST_ITEM_STATE' value='5'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_ITEM_STATE' value='6'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_FIRST_KEY_STATE' value='7'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_KEY_STATE' value='8'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_SIMPLE_VALUE_STATE' value='9'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_VALUE_STATE' value='10'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_FIRST_ITEM_STATE' value='11'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_ITEM_STATE' value='12'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_FIRST_KEY_STATE' value='13'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_KEY_STATE' value='14'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_SIMPLE_VALUE_STATE' value='15'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_VALUE_STATE' value='16'/>
      <enumerator name='YAML_EMIT_END_STATE' value='17'/>
    </enum-decl>
    <enum-decl name='yaml_encoding_e' filepath='/usr/include/yaml.h' line='99' column='1' id='type-id-253'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_ANY_ENCODING' value='0'/>
      <enumerator name='YAML_UTF8_ENCODING' value='1'/>
      <enumerator name='YAML_UTF16LE_ENCODING' value='2'/>
      <enumerator name='YAML_UTF16BE_ENCODING' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_error_type_e' filepath='/usr/include/yaml.h' line='124' column='1' id='type-id-254'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_NO_ERROR' value='0'/>
      <enumerator name='YAML_MEMORY_ERROR' value='1'/>
      <enumerator name='YAML_READER_ERROR' value='2'/>
      <enumerator name='YAML_SCANNER_ERROR' value='3'/>
      <enumerator name='YAML_PARSER_ERROR' value='4'/>
      <enumerator name='YAML_COMPOSER_ERROR' value='5'/>
      <enumerator name='YAML_WRITER_ERROR' value='6'/>
      <enumerator name='YAML_EMITTER_ERROR' value='7'/>
    </enum-decl>
    <enum-decl name='yaml_event_type_e' filepath='/usr/include/yaml.h' line='355' column='1' id='type-id-255'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_NO_EVENT' value='0'/>
      <enumerator name='YAML_STREAM_START_EVENT' value='1'/>
      <enumerator name='YAML_STREAM_END_EVENT' value='2'/>
      <enumerator name='YAML_DOCUMENT_START_EVENT' value='3'/>
      <enumerator name='YAML_DOCUMENT_END_EVENT' value='4'/>
      <enumerator name='YAML_ALIAS_EVENT' value='5'/>
      <enumerator name='YAML_SCALAR_EVENT' value='6'/>
      <enumerator name='YAML_SEQUENCE_START_EVENT' value='7'/>
      <enumerator name='YAML_SEQUENCE_END_EVENT' value='8'/>
      <enumerator name='YAML_MAPPING_START_EVENT' value='9'/>
      <enumerator name='YAML_MAPPING_END_EVENT' value='10'/>
    </enum-decl>
    <class-decl name='_GHashTableIter' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='45' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-257' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-257' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-257' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy4' type-id='type-id-38' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy5' type-id='type-id-47' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy6' type-id='type-id-257' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_anchors_s' size-in-bits='96' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1530' column='1' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='references' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='anchor' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='serialized' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1536' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_emitter_s' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1546' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-260' visibility='default' filepath='/usr/include/yaml.h' line='1554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-123' visibility='default' filepath='/usr/include/yaml.h' line='1556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='write_handler' type-id='type-id-261' visibility='default' filepath='/usr/include/yaml.h' line='1568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_handler_data' type-id='type-id-262' visibility='default' filepath='/usr/include/yaml.h' line='1571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-263' visibility='default' filepath='/usr/include/yaml.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buffer' type-id='type-id-264' visibility='default' filepath='/usr/include/yaml.h' line='1599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='raw_buffer' type-id='type-id-265' visibility='default' filepath='/usr/include/yaml.h' line='1611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='encoding' type-id='type-id-266' visibility='default' filepath='/usr/include/yaml.h' line='1614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='canonical' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='best_indent' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='best_width' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='unicode' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='line_break' type-id='type-id-267' visibility='default' filepath='/usr/include/yaml.h' line='1634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='states' type-id='type-id-268' visibility='default' filepath='/usr/include/yaml.h' line='1644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='state' type-id='type-id-269' visibility='default' filepath='/usr/include/yaml.h' line='1647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='events' type-id='type-id-270' visibility='default' filepath='/usr/include/yaml.h' line='1659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='indents' type-id='type-id-271' visibility='default' filepath='/usr/include/yaml.h' line='1669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tag_directives' type-id='type-id-272' visibility='default' filepath='/usr/include/yaml.h' line='1679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='indent' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='flow_level' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='root_context' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='sequence_context' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='mapping_context' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='simple_key_context' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='line' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='column' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='whitespace' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='indention' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='open_ended' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='anchor_data' type-id='type-id-273' visibility='default' filepath='/usr/include/yaml.h' line='1715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tag_data' type-id='type-id-274' visibility='default' filepath='/usr/include/yaml.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='scalar_data' type-id='type-id-275' visibility='default' filepath='/usr/include/yaml.h' line='1747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='opened' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='closed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='anchors' type-id='type-id-276' visibility='default' filepath='/usr/include/yaml.h' line='1764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='last_anchor_id' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='document' type-id='type-id-277' visibility='default' filepath='/usr/include/yaml.h' line='1770' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_event_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='386' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-279' visibility='default' filepath='/usr/include/yaml.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-280' visibility='default' filepath='/usr/include/yaml.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='476' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='418' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1662' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-282' visibility='default' filepath='/usr/include/yaml.h' line='1664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-282' visibility='default' filepath='/usr/include/yaml.h' line='1666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-282' visibility='default' filepath='/usr/include/yaml.h' line='1668' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1576' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size_written' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1582' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1602' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1708' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='anchor_length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alias' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1714' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='460' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='468' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='448' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-126' visibility='default' filepath='/usr/include/yaml.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='430' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='plain_implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='quoted_implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='style' type-id='type-id-131' visibility='default' filepath='/usr/include/yaml.h' line='444' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='424' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='426' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1718' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handle_length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='suffix' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='suffix_length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1590' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1598' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1730' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1734' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='multiline' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_plain_allowed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='block_plain_allowed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='single_quoted_allowed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block_allowed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='style' type-id='type-id-131' visibility='default' filepath='/usr/include/yaml.h' line='1746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1637' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-290' visibility='default' filepath='/usr/include/yaml.h' line='1639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-290' visibility='default' filepath='/usr/include/yaml.h' line='1641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-290' visibility='default' filepath='/usr/include/yaml.h' line='1643' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='395' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-266' visibility='default' filepath='/usr/include/yaml.h' line='397' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1650' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-292' visibility='default' filepath='/usr/include/yaml.h' line='1652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-292' visibility='default' filepath='/usr/include/yaml.h' line='1654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-292' visibility='default' filepath='/usr/include/yaml.h' line='1656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-292' visibility='default' filepath='/usr/include/yaml.h' line='1658' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1672' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-135' visibility='default' filepath='/usr/include/yaml.h' line='1674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-135' visibility='default' filepath='/usr/include/yaml.h' line='1676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-135' visibility='default' filepath='/usr/include/yaml.h' line='1678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='401' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version_directive' type-id='type-id-106' visibility='default' filepath='/usr/include/yaml.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag_directives' type-id='type-id-107' visibility='default' filepath='/usr/include/yaml.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='implicit' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCompareFunc' type-id='type-id-294' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='106' column='1' id='type-id-295'/>
    <typedef-decl name='GDataForeachFunc' type-id='type-id-296' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-297'/>
    <typedef-decl name='GDestroyNotify' type-id='type-id-298' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='113' column='1' id='type-id-299'/>
    <typedef-decl name='GEqualFunc' type-id='type-id-294' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='111' column='1' id='type-id-300'/>
    <typedef-decl name='GHashFunc' type-id='type-id-301' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='116' column='1' id='type-id-302'/>
    <typedef-decl name='GHashTableIter' type-id='type-id-256' filepath='/usr/include/glib-2.0/glib/ghash.h' line='43' column='1' id='type-id-187'/>
    <typedef-decl name='NetplanAddrGenMode' type-id='type-id-250' filepath='../src/types-internal.h' line='35' column='1' id='type-id-249'/>
    <typedef-decl name='__mode_t' type-id='type-id-155' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-303'/>
    <typedef-decl name='yaml_anchors_t' type-id='type-id-258' filepath='/usr/include/yaml.h' line='1537' column='1' id='type-id-304'/>
    <typedef-decl name='yaml_break_t' type-id='type-id-251' filepath='/usr/include/yaml.h' line='121' column='1' id='type-id-267'/>
    <typedef-decl name='yaml_emitter_state_t' type-id='type-id-252' filepath='/usr/include/yaml.h' line='1525' column='1' id='type-id-269'/>
    <typedef-decl name='yaml_emitter_t' type-id='type-id-259' filepath='/usr/include/yaml.h' line='1776' column='1' id='type-id-305'/>
    <typedef-decl name='yaml_encoding_t' type-id='type-id-253' filepath='/usr/include/yaml.h' line='108' column='1' id='type-id-266'/>
    <typedef-decl name='yaml_error_type_t' type-id='type-id-254' filepath='/usr/include/yaml.h' line='144' column='1' id='type-id-260'/>
    <typedef-decl name='yaml_event_t' type-id='type-id-278' filepath='/usr/include/yaml.h' line='478' column='1' id='type-id-306'/>
    <typedef-decl name='yaml_event_type_t' type-id='type-id-255' filepath='/usr/include/yaml.h' line='383' column='1' id='type-id-279'/>
    <typedef-decl name='yaml_write_handler_t' type-id='type-id-307' filepath='/usr/include/yaml.h' line='1482' column='1' id='type-id-308'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1574' column='1' id='type-id-263'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-283' visibility='default' filepath='/usr/include/yaml.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-166' visibility='default' filepath='/usr/include/yaml.h' line='1586' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='392' column='1' id='type-id-280'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-291' visibility='default' filepath='/usr/include/yaml.h' line='398' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_start' type-id='type-id-293' visibility='default' filepath='/usr/include/yaml.h' line='415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_end' type-id='type-id-281' visibility='default' filepath='/usr/include/yaml.h' line='421' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-289' visibility='default' filepath='/usr/include/yaml.h' line='427' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-288' visibility='default' filepath='/usr/include/yaml.h' line='445' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence_start' type-id='type-id-287' visibility='default' filepath='/usr/include/yaml.h' line='457' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping_start' type-id='type-id-286' visibility='default' filepath='/usr/include/yaml.h' line='469' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-311'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-123' restrict='yes' id='type-id-313'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-314'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-261'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-322'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-323'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-262'/>
    <function-decl name='netplan_auth_key_management_type_name' filepath='../src/names.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_auth_eap_method_name' filepath='../src/names.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_addr_gen_mode_name' filepath='../src/names.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_wifi_mode_name' filepath='../src/names.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_infiniband_mode_name' filepath='../src/names.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_vxlan_notification_name' filepath='../src/names.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_vxlan_checksum_name' filepath='../src/names.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_vxlan_extension_name' filepath='../src/names.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_yaml' mangled-name='netplan_netdef_write_yaml' filepath='../src/netplan.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_yaml'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/netplan.c' line='935' column='1'/>
      <parameter type-id='type-id-179' name='netdef' filepath='../src/netplan.c' line='936' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/netplan.c' line='937' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/netplan.c' line='938' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_write_yaml_file' mangled-name='netplan_state_write_yaml_file' filepath='../src/netplan.c' line='1113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_write_yaml_file'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/netplan.c' line='1113' column='1'/>
      <parameter type-id='type-id-123' name='filename' filepath='../src/netplan.c' line='1113' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/netplan.c' line='1113' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/netplan.c' line='1113' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_dump_yaml' mangled-name='netplan_state_dump_yaml' filepath='../src/netplan.c' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_dump_yaml'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/netplan.c' line='1168' column='1'/>
      <parameter type-id='type-id-38' name='out_fd' filepath='../src/netplan.c' line='1168' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/netplan.c' line='1168' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_update_yaml_hierarchy' mangled-name='netplan_state_update_yaml_hierarchy' filepath='../src/netplan.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_update_yaml_hierarchy'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/netplan.c' line='1187' column='1'/>
      <parameter type-id='type-id-123' name='default_filename' filepath='../src/netplan.c' line='1187' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/netplan.c' line='1187' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/netplan.c' line='1187' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='get_default_backend_for_type' filepath='../src/util-internal.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='has_openvswitch' filepath='../src/util-internal.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='complex_object_is_dirty' filepath='../src/util-internal.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-324'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-282'/>
    </function-decl>
    <function-decl name='g_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='/usr/include/glib-2.0/glib/garray.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_array_append_vals' filepath='/usr/include/glib-2.0/glib/garray.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_datalist_foreach' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_hash_table_new_full' filepath='/usr/include/glib-2.0/glib/ghash.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-300'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='g_hash_table_destroy' filepath='/usr/include/glib-2.0/glib/ghash.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_hash_table_insert' filepath='/usr/include/glib-2.0/glib/ghash.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_extended' filepath='/usr/include/glib-2.0/glib/ghash.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-316'/>
      <parameter type-id='type-id-316'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_contains' filepath='/usr/include/glib-2.0/glib/ghash.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup_extended' filepath='/usr/include/glib-2.0/glib/ghash.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-316'/>
      <parameter type-id='type-id-316'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_size' filepath='/usr/include/glib-2.0/glib/ghash.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_init' filepath='/usr/include/glib-2.0/glib/ghash.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_next' filepath='/usr/include/glib-2.0/glib/ghash.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-316'/>
      <parameter type-id='type-id-316'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_str_equal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_str_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_list_free' filepath='/usr/include/glib-2.0/glib/glist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_list_append' filepath='/usr/include/glib-2.0/glib/glist.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_list_find_custom' filepath='/usr/include/glib-2.0/glib/glist.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_quark_to_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='g_strdup_printf' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_strconcat' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_strsplit' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='g_strfreev' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-262' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-257'/>
    <typedef-decl name='gconstpointer' type-id='type-id-324' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='104' column='1' id='type-id-325'/>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-166'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-303'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='dup' filepath='/usr/include/unistd.h' line='552' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_stream_start_event_initialize' filepath='/usr/include/yaml.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_stream_end_event_initialize' filepath='/usr/include/yaml.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_document_start_event_initialize' filepath='/usr/include/yaml.h' line='524' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_document_end_event_initialize' filepath='/usr/include/yaml.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_scalar_event_initialize' filepath='/usr/include/yaml.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_sequence_start_event_initialize' filepath='/usr/include/yaml.h' line='603' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_sequence_end_event_initialize' filepath='/usr/include/yaml.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_mapping_start_event_initialize' filepath='/usr/include/yaml.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_mapping_end_event_initialize' filepath='/usr/include/yaml.h' line='648' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_emitter_initialize' filepath='/usr/include/yaml.h' line='1790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_emitter_delete' filepath='/usr/include/yaml.h' line='1799' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='yaml_emitter_set_output_file' filepath='/usr/include/yaml.h' line='1831' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='yaml_emitter_emit' filepath='/usr/include/yaml.h' line='1922' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-307'>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-317'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-47'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-318'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-46'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-319'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-150'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-320'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-150'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/networkd.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <typedef-decl name='GHFunc' type-id='type-id-326' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='117' column='1' id='type-id-327'/>
    <typedef-decl name='gssize' type-id='type-id-39' filepath='/usr/lib/glib-2.0/include/glibconfig.h' line='77' column='1' id='type-id-328'/>
    <typedef-decl name='guint64' type-id='type-id-3' filepath='/usr/lib/glib-2.0/include/glibconfig.h' line='62' column='1' id='type-id-329'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-330'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-326'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-335'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-336'/>
    <function-decl name='netplan_netdef_write_network_file' mangled-name='netplan_netdef_write_network_file' filepath='../src/networkd.c' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_network_file'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/networkd.c' line='701' column='1'/>
      <parameter type-id='type-id-179' name='def' filepath='../src/networkd.c' line='702' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/networkd.c' line='703' column='1'/>
      <parameter type-id='type-id-123' name='path' filepath='../src/networkd.c' line='704' column='1'/>
      <parameter type-id='type-id-333' name='has_been_written' filepath='../src/networkd.c' line='705' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/networkd.c' line='706' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_networkd' mangled-name='netplan_netdef_write_networkd' filepath='../src/networkd.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_networkd'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/networkd.c' line='1254' column='1'/>
      <parameter type-id='type-id-179' name='def' filepath='../src/networkd.c' line='1255' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/networkd.c' line='1256' column='1'/>
      <parameter type-id='type-id-333' name='has_been_written' filepath='../src/networkd.c' line='1257' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/networkd.c' line='1258' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_networkd_cleanup' mangled-name='netplan_networkd_cleanup' filepath='../src/networkd.c' line='1321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_networkd_cleanup'>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/networkd.c' line='1321' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='safe_mkdir_p_dir' filepath='../src/util-internal.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_string_free_to_file' filepath='../src/util-internal.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='unlink_glob' filepath='../src/util-internal.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='get_global_network' filepath='../src/util-internal.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='wifi_get_freq24' filepath='../src/util-internal.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='wifi_get_freq5' filepath='../src/util-internal.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='systemd_escape' filepath='../src/util-internal.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='is_multicast_address' filepath='../src/util-internal.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_wireguard_key' filepath='../src/validation.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-332'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach' filepath='/usr/include/glib-2.0/glib/ghash.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-337'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_ascii_strtoull' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='g_strjoin' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_string_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='g_string_append' filepath='/usr/include/glib-2.0/glib/gstring.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='g_string_insert_c' filepath='/usr/include/glib-2.0/glib/gstring.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='g_string_overwrite' filepath='/usr/include/glib-2.0/glib/gstring.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='g_string_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-184'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-336' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-337'/>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-334'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-337'/>
      <return type-id='type-id-150'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/nm.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <typedef-decl name='GKeyFile' type-id='type-id-338' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='48' column='1' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-341'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-343'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-345'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-346'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-338'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-347'/>
    <function-decl name='netplan_netdef_write_nm' mangled-name='netplan_netdef_write_nm' filepath='../src/nm.c' line='946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_nm'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/nm.c' line='947' column='1'/>
      <parameter type-id='type-id-179' name='netdef' filepath='../src/nm.c' line='948' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/nm.c' line='949' column='1'/>
      <parameter type-id='type-id-333' name='has_been_written' filepath='../src/nm.c' line='950' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/nm.c' line='951' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_finish_nm_write' mangled-name='netplan_state_finish_nm_write' filepath='../src/nm.c' line='988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_nm_write'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/nm.c' line='989' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/nm.c' line='990' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/nm.c' line='991' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_nm_cleanup' mangled-name='netplan_nm_cleanup' filepath='../src/nm.c' line='1096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_nm_cleanup'>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/nm.c' line='1096' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_datalist_get_data' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-348'/>
    </function-decl>
    <function-decl name='g_key_file_new' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-340'/>
    </function-decl>
    <function-decl name='g_key_file_unref' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_save_to_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_has_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_set_value' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_get_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_key_file_set_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_set_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_set_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_set_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_set_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_key_file_set_comment' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_remove_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_ascii_strcasecmp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='g_strjoinv' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_strv_length' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_string_ascii_down' filepath='/usr/include/glib-2.0/glib/gstring.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-347' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-348'/>
    <function-decl name='g_uri_escape_string' filepath='/usr/include/glib-2.0/glib/guri.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='strpbrk' filepath='/usr/include/string.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='uuid_generate' filepath='/usr/include/uuid/uuid.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='uuid_is_null' filepath='/usr/include/uuid/uuid.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='uuid_unparse' filepath='/usr/include/uuid/uuid.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-150'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/openvswitch.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-349'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-350'/>
    <function-decl name='netplan_netdef_write_ovs' mangled-name='netplan_netdef_write_ovs' filepath='../src/openvswitch.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_ovs'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-179' name='def' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-333' name='has_been_written' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/openvswitch.c' line='320' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_finish_ovs_write' mangled-name='netplan_state_finish_ovs_write' filepath='../src/openvswitch.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_ovs_write'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/openvswitch.c' line='461' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/openvswitch.c' line='461' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/openvswitch.c' line='461' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_ovs_cleanup' mangled-name='netplan_ovs_cleanup' filepath='../src/openvswitch.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_ovs_cleanup'>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/openvswitch.c' line='507' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_str_has_prefix' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_string_erase' filepath='/usr/include/glib-2.0/glib/gstring.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-350' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-351'/>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse-nm.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <enum-decl name='GKeyFileFlags' naming-typedef-id='type-id-352' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='51' column='1' id='type-id-353'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='G_KEY_FILE_NONE' value='0'/>
      <enumerator name='G_KEY_FILE_KEEP_COMMENTS' value='1'/>
      <enumerator name='G_KEY_FILE_KEEP_TRANSLATIONS' value='2'/>
    </enum-decl>
    <typedef-decl name='GKeyFileFlags' type-id='type-id-353' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='55' column='1' id='type-id-352'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-356'/>
    <function-decl name='netplan_parser_load_keyfile' mangled-name='netplan_parser_load_keyfile' filepath='../src/parse-nm.c' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_keyfile'>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse-nm.c' line='582' column='1'/>
      <parameter type-id='type-id-123' name='filename' filepath='../src/parse-nm.c' line='582' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse-nm.c' line='582' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='reset_vxlan' filepath='../src/types-internal.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='get_unspecified_address' filepath='../src/util-internal.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='netplan_netdef_new' filepath='../src/util-internal.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='validate_netdef_grammar' filepath='../src/validation.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_datalist_init' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_datalist_id_set_data_full' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-358'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_hash_table_new' filepath='/usr/include/glib-2.0/glib/ghash.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='g_key_file_load_from_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_get_groups' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='g_key_file_get_keys' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='g_key_file_has_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_get_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_key_file_get_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='g_key_file_get_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='g_key_file_get_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='g_key_file_remove_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_malloc0' filepath='/usr/include/glib-2.0/glib/gmem.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-358'/>
    </function-decl>
    <function-decl name='g_malloc0_n' filepath='/usr/include/glib-2.0/glib/gmem.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-358'/>
    </function-decl>
    <function-decl name='g_quark_from_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='g_strrstr' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-356' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-358'/>
    <typedef-decl name='gconstpointer' type-id='type-id-355' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='104' column='1' id='type-id-359'/>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-360'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-361' size-in-bits='768' id='type-id-362'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-3' id='type-id-363'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-361' size-in-bits='unknown' id='type-id-364'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-365'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-366' size-in-bits='1280' id='type-id-367'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-3' id='type-id-368'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-366' size-in-bits='unknown' id='type-id-369'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-365'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-370' size-in-bits='192' id='type-id-371'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-3' id='type-id-372'/>
    </array-type-def>
    <enum-decl name='yaml_parser_state_e' filepath='/usr/include/yaml.h' line='1012' column='1' id='type-id-373'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_PARSE_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_PARSE_IMPLICIT_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_PARSE_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_PARSE_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_PARSE_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_STATE' value='5'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_OR_INDENTLESS_SEQUENCE_STATE' value='6'/>
      <enumerator name='YAML_PARSE_FLOW_NODE_STATE' value='7'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_FIRST_ENTRY_STATE' value='8'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_ENTRY_STATE' value='9'/>
      <enumerator name='YAML_PARSE_INDENTLESS_SEQUENCE_ENTRY_STATE' value='10'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_FIRST_KEY_STATE' value='11'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_KEY_STATE' value='12'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_VALUE_STATE' value='13'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_FIRST_ENTRY_STATE' value='14'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_STATE' value='15'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_KEY_STATE' value='16'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_VALUE_STATE' value='17'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_END_STATE' value='18'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_FIRST_KEY_STATE' value='19'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_KEY_STATE' value='20'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_VALUE_STATE' value='21'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_EMPTY_VALUE_STATE' value='22'/>
      <enumerator name='YAML_PARSE_END_STATE' value='23'/>
    </enum-decl>
    <enum-decl name='yaml_token_type_e' filepath='/usr/include/yaml.h' line='215' column='1' id='type-id-374'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='YAML_NO_TOKEN' value='0'/>
      <enumerator name='YAML_STREAM_START_TOKEN' value='1'/>
      <enumerator name='YAML_STREAM_END_TOKEN' value='2'/>
      <enumerator name='YAML_VERSION_DIRECTIVE_TOKEN' value='3'/>
      <enumerator name='YAML_TAG_DIRECTIVE_TOKEN' value='4'/>
      <enumerator name='YAML_DOCUMENT_START_TOKEN' value='5'/>
      <enumerator name='YAML_DOCUMENT_END_TOKEN' value='6'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_START_TOKEN' value='7'/>
      <enumerator name='YAML_BLOCK_MAPPING_START_TOKEN' value='8'/>
      <enumerator name='YAML_BLOCK_END_TOKEN' value='9'/>
      <enumerator name='YAML_FLOW_SEQUENCE_START_TOKEN' value='10'/>
      <enumerator name='YAML_FLOW_SEQUENCE_END_TOKEN' value='11'/>
      <enumerator name='YAML_FLOW_MAPPING_START_TOKEN' value='12'/>
      <enumerator name='YAML_FLOW_MAPPING_END_TOKEN' value='13'/>
      <enumerator name='YAML_BLOCK_ENTRY_TOKEN' value='14'/>
      <enumerator name='YAML_FLOW_ENTRY_TOKEN' value='15'/>
      <enumerator name='YAML_KEY_TOKEN' value='16'/>
      <enumerator name='YAML_VALUE_TOKEN' value='17'/>
      <enumerator name='YAML_ALIAS_TOKEN' value='18'/>
      <enumerator name='YAML_ANCHOR_TOKEN' value='19'/>
      <enumerator name='YAML_TAG_TOKEN' value='20'/>
      <enumerator name='YAML_SCALAR_TOKEN' value='21'/>
    </enum-decl>
    <class-decl name='NetplanOptionalAddressType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='37' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-43' visibility='default' filepath='../src/types-internal.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-20' visibility='default' filepath='../src/types-internal.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWifiWowlanType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='74' column='1' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-32' visibility='default' filepath='../src/abi.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-376' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-377' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-377' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-378' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-43' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-284' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-75' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='type-id-155' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-379' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-381' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-381' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-383' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-384' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-385' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-303' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-386' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-387' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-383' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-388' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-389' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-390' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-390' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-390' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-371' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-391' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-370' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_alias_data_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1071' column='1' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='1077' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_parser_s' size-in-bits='3840' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1087' column='1' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-260' visibility='default' filepath='/usr/include/yaml.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-123' visibility='default' filepath='/usr/include/yaml.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='problem_offset' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='problem_value' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='problem_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='context' type-id='type-id-123' visibility='default' filepath='/usr/include/yaml.h' line='1105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='context_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='1107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='read_handler' type-id='type-id-394' visibility='default' filepath='/usr/include/yaml.h' line='1119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='read_handler_data' type-id='type-id-395' visibility='default' filepath='/usr/include/yaml.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='input' type-id='type-id-396' visibility='default' filepath='/usr/include/yaml.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='eof' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='buffer' type-id='type-id-264' visibility='default' filepath='/usr/include/yaml.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='unread' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='raw_buffer' type-id='type-id-265' visibility='default' filepath='/usr/include/yaml.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='encoding' type-id='type-id-266' visibility='default' filepath='/usr/include/yaml.h' line='1171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='offset' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='1177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='stream_start_produced' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='stream_end_produced' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='flow_level' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tokens' type-id='type-id-397' visibility='default' filepath='/usr/include/yaml.h' line='1207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tokens_parsed' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='token_available' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='indents' type-id='type-id-271' visibility='default' filepath='/usr/include/yaml.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='indent' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='simple_key_allowed' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='simple_keys' type-id='type-id-398' visibility='default' filepath='/usr/include/yaml.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='states' type-id='type-id-399' visibility='default' filepath='/usr/include/yaml.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='state' type-id='type-id-400' visibility='default' filepath='/usr/include/yaml.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='marks' type-id='type-id-401' visibility='default' filepath='/usr/include/yaml.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='tag_directives' type-id='type-id-272' visibility='default' filepath='/usr/include/yaml.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='aliases' type-id='type-id-402' visibility='default' filepath='/usr/include/yaml.h' line='1300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='document' type-id='type-id-277' visibility='default' filepath='/usr/include/yaml.h' line='1303' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_simple_key_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='995' column='1' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='possible' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='required' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='token_number' type-id='type-id-75' visibility='default' filepath='/usr/include/yaml.h' line='1003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='1006' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_token_s' size-in-bits='640' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='269' column='1' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-405' visibility='default' filepath='/usr/include/yaml.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-406' visibility='default' filepath='/usr/include/yaml.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='start_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='end_mark' type-id='type-id-108' visibility='default' filepath='/usr/include/yaml.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1127' column='1' id='type-id-407'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-344' visibility='default' filepath='/usr/include/yaml.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-344' visibility='default' filepath='/usr/include/yaml.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current' type-id='type-id-344' visibility='default' filepath='/usr/include/yaml.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='314' column='1' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-38' visibility='default' filepath='/usr/include/yaml.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1293' column='1' id='type-id-402'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-409' visibility='default' filepath='/usr/include/yaml.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-409' visibility='default' filepath='/usr/include/yaml.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-409' visibility='default' filepath='/usr/include/yaml.h' line='1299' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='322' column='1' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='296' column='1' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suffix' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='284' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-113' visibility='default' filepath='/usr/include/yaml.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1264' column='1' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-413' visibility='default' filepath='/usr/include/yaml.h' line='1266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-413' visibility='default' filepath='/usr/include/yaml.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-413' visibility='default' filepath='/usr/include/yaml.h' line='1270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1251' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-414' visibility='default' filepath='/usr/include/yaml.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-414' visibility='default' filepath='/usr/include/yaml.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-414' visibility='default' filepath='/usr/include/yaml.h' line='1257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1232' column='1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-415' visibility='default' filepath='/usr/include/yaml.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-415' visibility='default' filepath='/usr/include/yaml.h' line='1236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-415' visibility='default' filepath='/usr/include/yaml.h' line='1238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1198' column='1' id='type-id-397'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-416' visibility='default' filepath='/usr/include/yaml.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-416' visibility='default' filepath='/usr/include/yaml.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-416' visibility='default' filepath='/usr/include/yaml.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-416' visibility='default' filepath='/usr/include/yaml.h' line='1206' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHRFunc' type-id='type-id-417' filepath='/usr/include/glib-2.0/glib/ghash.h' line='39' column='1' id='type-id-418'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-389'/>
    <typedef-decl name='__blksize_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-388'/>
    <typedef-decl name='__dev_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-383'/>
    <typedef-decl name='__gid_t' type-id='type-id-155' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-387'/>
    <typedef-decl name='__ino_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-384'/>
    <typedef-decl name='__nlink_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-385'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-377'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-370'/>
    <typedef-decl name='__time_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-391'/>
    <typedef-decl name='__uid_t' type-id='type-id-155' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-386'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-378'/>
    <typedef-decl name='regex_t' type-id='type-id-375' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-419'/>
    <typedef-decl name='regmatch_t' type-id='type-id-380' filepath='/usr/include/regex.h' line='521' column='1' id='type-id-379'/>
    <typedef-decl name='regoff_t' type-id='type-id-38' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-381'/>
    <typedef-decl name='yaml_alias_data_t' type-id='type-id-392' filepath='/usr/include/yaml.h' line='1078' column='1' id='type-id-420'/>
    <typedef-decl name='yaml_parser_state_t' type-id='type-id-373' filepath='/usr/include/yaml.h' line='1065' column='1' id='type-id-400'/>
    <typedef-decl name='yaml_parser_t' type-id='type-id-393' filepath='/usr/include/yaml.h' line='1309' column='1' id='type-id-421'/>
    <typedef-decl name='yaml_read_handler_t' type-id='type-id-422' filepath='/usr/include/yaml.h' line='988' column='1' id='type-id-423'/>
    <typedef-decl name='yaml_simple_key_t' type-id='type-id-403' filepath='/usr/include/yaml.h' line='1007' column='1' id='type-id-424'/>
    <typedef-decl name='yaml_token_t' type-id='type-id-404' filepath='/usr/include/yaml.h' line='336' column='1' id='type-id-425'/>
    <typedef-decl name='yaml_token_type_t' type-id='type-id-374' filepath='/usr/include/yaml.h' line='266' column='1' id='type-id-405'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1125' column='1' id='type-id-396'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-407' visibility='default' filepath='/usr/include/yaml.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-166' visibility='default' filepath='/usr/include/yaml.h' line='1137' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='275' column='1' id='type-id-406'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-291' visibility='default' filepath='/usr/include/yaml.h' line='281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-412' visibility='default' filepath='/usr/include/yaml.h' line='287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='anchor' type-id='type-id-412' visibility='default' filepath='/usr/include/yaml.h' line='293' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag' type-id='type-id-411' visibility='default' filepath='/usr/include/yaml.h' line='301' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-130' visibility='default' filepath='/usr/include/yaml.h' line='311' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='version_directive' type-id='type-id-408' visibility='default' filepath='/usr/include/yaml.h' line='319' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag_directive' type-id='type-id-410' visibility='default' filepath='/usr/include/yaml.h' line='327' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-431'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-432' restrict='yes' id='type-id-360'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-433'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-435'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-437'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-357'/>
    <qualified-type-def type-id='type-id-419' const='yes' id='type-id-438'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-439' restrict='yes' id='type-id-440'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-441'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-443'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-446'/>
    <qualified-type-def type-id='type-id-446' restrict='yes' id='type-id-447'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-448' restrict='yes' id='type-id-449'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-450'/>
    <qualified-type-def type-id='type-id-450' restrict='yes' id='type-id-451'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-416'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-454'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-445'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-395'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-455'/>
    <function-decl name='parser_error' filepath='../src/error.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-444'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='yaml_error' filepath='../src/error.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-442'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-123'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml_from_fd' mangled-name='netplan_parser_load_yaml_from_fd' filepath='../src/parse.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml_from_fd'>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse.c' line='3286' column='1'/>
      <parameter type-id='type-id-38' name='fd' filepath='../src/parse.c' line='3286' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse.c' line='3286' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml' mangled-name='netplan_parser_load_yaml' filepath='../src/parse.c' line='3299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml'>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse.c' line='3299' column='1'/>
      <parameter type-id='type-id-123' name='filename' filepath='../src/parse.c' line='3299' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse.c' line='3299' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_state_import_parser_results' mangled-name='netplan_state_import_parser_results' filepath='../src/parse.c' line='3340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_import_parser_results'>
      <parameter type-id='type-id-173' name='np_state' filepath='../src/parse.c' line='3340' column='1'/>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse.c' line='3340' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse.c' line='3340' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_new' mangled-name='netplan_parser_new' filepath='../src/parse.c' line='3411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_new'>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='netplan_parser_load_nullable_fields' mangled-name='netplan_parser_load_nullable_fields' filepath='../src/parse.c' line='3579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_nullable_fields'>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse.c' line='3579' column='1'/>
      <parameter type-id='type-id-38' name='input_fd' filepath='../src/parse.c' line='3579' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse.c' line='3579' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_parser_load_nullable_overrides' mangled-name='netplan_parser_load_nullable_overrides' filepath='../src/parse.c' line='3598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_nullable_overrides'>
      <parameter type-id='type-id-171' name='npp' filepath='../src/parse.c' line='3599' column='1'/>
      <parameter type-id='type-id-38' name='input_fd' filepath='../src/parse.c' line='3599' column='1'/>
      <parameter type-id='type-id-123' name='constraint' filepath='../src/parse.c' line='3599' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/parse.c' line='3599' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <var-decl name='NETPLAN_OPTIONAL_ADDRESS_TYPES' type-id='type-id-362' mangled-name='NETPLAN_OPTIONAL_ADDRESS_TYPES' visibility='default' filepath='../src/types-internal.h' line='61' column='1' elf-symbol-id='NETPLAN_OPTIONAL_ADDRESS_TYPES'/>
    <var-decl name='NETPLAN_WIFI_WOWLAN_TYPES' type-id='type-id-367' mangled-name='NETPLAN_WIFI_WOWLAN_TYPES' visibility='default' filepath='../src/types-internal.h' line='63' column='1' elf-symbol-id='NETPLAN_WIFI_WOWLAN_TYPES'/>
    <function-decl name='reset_netdef' filepath='../src/types-internal.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='reset_ip_rule' filepath='../src/types-internal.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='reset_ovs_settings' filepath='../src/types-internal.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-429'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='access_point_clear' filepath='../src/types-internal.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-430'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='wireguard_peer_clear' filepath='../src/types-internal.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-431'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='address_options_clear' filepath='../src/types-internal.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-426'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='ip_rule_clear' filepath='../src/types-internal.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-428'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='route_clear' filepath='../src/types-internal.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-427'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='clear_netdef_from_list' filepath='../src/types-internal.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-395'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='mark_data_as_dirty' filepath='../src/util-internal.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-455'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='is_route_present' filepath='../src/util-internal.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_route_rule_present' filepath='../src/util-internal.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-436'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_string_in_array' filepath='../src/util-internal.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_ip4_address' filepath='../src/validation.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_ip6_address' filepath='../src/validation.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='is_hostname' filepath='../src/validation.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='validate_ovs_target' filepath='../src/validation.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='validate_backend_rules' filepath='../src/validation.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='validate_sriov_rules' filepath='../src/validation.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='validate_default_route_consistency' filepath='../src/validation.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='adopt_and_validate_vrf_routes' filepath='../src/validation.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_datalist_clear' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_path_get_basename' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_hash_table_add' filepath='/usr/include/glib-2.0/glib/ghash.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-457'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach_steal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-418'/>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_list_free_full' filepath='/usr/include/glib-2.0/glib/glist.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='g_list_prepend' filepath='/usr/include/glib-2.0/glib/glist.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_list_concat' filepath='/usr/include/glib-2.0/glib/glist.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_list_length' filepath='/usr/include/glib-2.0/glib/glist.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_strchug' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_strchomp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='g_assertion_message_cmpstr' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='545' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-395' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-456'/>
    <typedef-decl name='gconstpointer' type-id='type-id-455' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='104' column='1' id='type-id-457'/>
    <function-decl name='regcomp' filepath='/usr/include/regex.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-447'/>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='679' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-449'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-360'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-395'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='yaml_document_delete' filepath='/usr/include/yaml.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='yaml_document_get_node' filepath='/usr/include/yaml.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='yaml_document_get_root_node' filepath='/usr/include/yaml.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='yaml_parser_initialize' filepath='/usr/include/yaml.h' line='1323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-453'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='yaml_parser_delete' filepath='/usr/include/yaml.h' line='1332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-453'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='yaml_parser_set_input_file' filepath='/usr/include/yaml.h' line='1361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-453'/>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='yaml_parser_load' filepath='/usr/include/yaml.h' line='1457' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-453'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-422'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-38'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-452'>
      <parameter type-id='type-id-456'/>
      <parameter type-id='type-id-456'/>
      <parameter type-id='type-id-456'/>
      <return type-id='type-id-47'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/sriov.c' comp-dir-path='/root/netplan/build' language='LANG_C99'>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-458'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-459'/>
    <function-decl name='netplan_state_finish_sriov_write' mangled-name='netplan_state_finish_sriov_write' filepath='../src/sriov.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_sriov_write'>
      <parameter type-id='type-id-181' name='np_state' filepath='../src/sriov.c' line='68' column='1'/>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/sriov.c' line='68' column='1'/>
      <parameter type-id='type-id-168' name='error' filepath='../src/sriov.c' line='68' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='netplan_sriov_cleanup' mangled-name='netplan_sriov_cleanup' filepath='../src/sriov.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_sriov_cleanup'>
      <parameter type-id='type-id-123' name='rootdir' filepath='../src/sriov.c' line='118' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_netplan_state_get_vf_count_for_def' mangled-name='_netplan_state_get_vf_count_for_def' filepath='../src/sriov.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_state_get_vf_count_for_def'>
